import{_ as y,i as d,b as x,o as s,c as l,a as i,F as f,e as g,d as r,w as o,t as m,h as w}from"./index-21be58db.js";const h={setup(){let p=[{id:1,title:"我16年毕业后都做了那些，为什么会走上编程这条路？",answer:`
        <p style='text-indent: 32px;'>我于16年毕业于河南省郑州市北环路华北水利水电大学建筑工程技术专业，毕业后在郑州棉纺路锦艺城附近一家名为 玉博苑 的玉器零售批发公司做门店管理的基础工作，
          负责日常进货，做专业证书，整理财务报表，门店信息统计，日常营业收入分析，目标客户人群分析，员工培训等。因与总经理经营理念不同，最终分道扬镳。</p>
        <p style='text-indent: 32px;'>而后去过广东惠州《伯恩光学有限公司》全自动光学检测部门（简称AIO）工作半年，因论文需要答辩，终止了合同</p>
        <p style='text-indent: 32px;'>再后来在家进行为期半年的游戏直播，平台为《熊猫直播》</p>
        <div style='font-size:24px;font-weight:bold;line-height:48px;text-align:center'>为什么我会走上编程这条路？ 因为游戏外挂!</div>
        <p style='text-indent: 32px;'>说来可笑，读书期间一直在玩一款名为《地下城与勇士》的游戏，该游戏制作精良，剧情耐人寻味，让我每每陷入其中无法自拔，我个人为了获取更多的资源和能力，
          于互联网搜索歪点子接触到了一款名为“封包”的软件，
        “封包”对我来说并不陌生，大学期间不止一次旁听隔壁计算机系的课程，多少也知道“封包”是个什么技术及原理，于是开始在游戏内获取服务器返回的关键字段信息，本地进行重组包装后再次重新发送
        给服务器以实现个人目的。</p>
        <p style='text-indent: 32px;'>当自己亲身感受到代码带来的魅力后，对它的喜欢愈发不可收拾。</p>`},{id:2,title:"我一个河南人，为什么会在北京工作？",answer:`<p style='text-indent: 32px;'>在直播生活的末期，个人察觉到此时的我的直播已经是虚度光阴，没有高额的收入，没有可以遇见的未来
        。萌生退意的时候，我的大学同学刘某告诉我，他随父母来到北京后，在北京某幼儿娱教中心做老师助理，北京的薪资待遇对比南阳小城市来说是相当不错的，希望我也来大城市看一看，毕业后也没有再聚
        在一起，如果实在不顺心可以考虑去北京试试。便选择成为一名北漂去试一试大城市的生活</p>
        <p style='text-indent: 32px;'>来到北京后，首先要考虑的是生存问题，便选择了一家超5星级私人酒店想从事酒店服务员的工作，可面试时候，面试官的一席话改变了我的想法。</p>
        <p style='text-indent: 32px;font-weight:bold;line-height:32px;'>"很多年轻人来到北京，第一份工作都会选择酒店，原因我是知道的，北京是一个充满机会的城市，如果你心中还有梦想，不要把它浪费在这里，去做你喜欢的事情吧，也许前期会很苦，
          未来将会是甜蜜的，毕竟你还年轻，还有青春可以试错，大胆去尝试吧，如果实在无法适应北京的生活，打电话联系我，再回来，我们还缺你这样的人。"</p>
          <p style='text-indent: 32px;'>那是我第一次遇到陌生人一眼看穿我内心想法，而且最大限度保留我最后一点点自尊的陌生人，从酒店出来后，我在酒店门口脑子放空很很久。我在思考，
            我除了基础工作外，我还能干什么？身高只有160+的我，靠体力劳动很难竞争过其他的人，我现在需要一份高附加值的工作，而且最好是其他人无法轻易替代我，我想赌一赌去试试编程。</p>
            <p style='text-indent: 32px;'>由于之前在玉博苑做玉器推广的时候，和另外一个师傅一起写过一个电商平台的前端，最后由于老板没有申请到《网络经营许可证》，最终无法上线，学到一些
              前端基础（ajax，css3，html5，bootstrap，swiper，vue2）我决定去试一试前端开发，我记得很清楚那是2018年9月22日周一，我去面试一家名为《APIcloud》的公司，在3楼进门后的左手边
              一个非常小的屋子里，他问了我3句话。“写过小程序么？” “没有" "写过react么？“ ”没有“ ”好了。明天过来上班吧“ 坐如针毡的就是以这种不可思议的方式开启了人生正式编程的第一份工作，直到现在
              非常感谢面试官，我记得他的名字，他姓江。</p>
        `},{id:3,title:"是什么原因导致我离开北京？",answer:`
      <p style='text-indent: 32px;'>我在北京的第二年，我的好朋友刘某，回到了南召县老家。同年我的一位关系非常好的同事也离开了北京。</p>
      <p style='text-indent: 32px;'>只记得那个秋天很冷，很灰。偌大的一个城市，竟觉得有些空荡。北京如此繁华城市，我却找不到第二个可以说说心里话的人，在天桥上看着街道两旁冒着热气的包子和行人，我想我是不是也该离开了。</p>
      <p style='text-indent: 32px;'>2020年10月，那是我决定离开北京的那段时间，爷爷生病在家，一直念叨着孙子现在出人头地了，能在北京工作，风不吹日不晒，未来一定是个好孩子。
        只可惜爷爷现在身体不行，没办法去北京看看首都了，在那边要好好工作，别给家里惹麻烦。</p>
      <p style='text-indent: 32px;'>我的爷爷很疼爱我，我想为他做点什么，看着如今爷爷居住的环境，一间很破的厨房，取暖烤村里烧的煤和碳，屋里也没有灯光，采光全靠没有玻璃的窗户，
        房子盖好几年了，却迟迟没有装修。爷爷没办法来，那我就做爷爷的眼睛，我要把我在北京的生活录下来给爷爷看，不想在北京留下遗憾。国庆后，我带上了大疆osmo action拍摄了我生活日常，
        天安门升国旗和伟大的故宫，并常常在镜头前念叨个不停，希望爷爷看到的时候觉得孙子就在身边为他讲述北京发生的一切。</p>
        <p style='text-indent: 32px;'>没想到最后压倒骆驼的最后一根稻草发生在2021年2月8日下午，依稀记得那是农历腊月二廿七，我一如往常满心期待的准备好回家过年，让爷爷看到我为他准备的礼物，
          大概是下午4点钟左右，发小高某突然来电，让我做好心理准备，家里出事了。</p>
          <p style='text-indent: 32px;'>爷爷最终没等到我给他准备礼物，很突然的离开了。那天晚上我没有哭，完全无法接受这样的噩耗以及迟到的孝顺。</p>
      `},{id:4,title:"为什么隔了半年才去西安工作？",answer:`
      <p style='text-indent: 32px;'>迟迟没有装修的房子一直是我心头一块病，每年回老家借宿大伯家中，很多不方便的事情以及爸妈生气的原因都来自没有属于自己的家，
        理想远超现实，可生活总是这么操蛋。趁着奶奶还在，把1,2层装了，奶奶回来也有个相对舒服的住所，不要让孝顺再次迟到。清明给爷爷上了坟，得出去赚钱了。</p>
      `},{id:5,title:"为什么在西安就工作了2个月？",answer:`
      <p style='text-indent: 32px;'>入职西安中国银行是2022年6月15日，离开中行是在2022年8月25日。8月西安疫情正严重，17日园区内一例阳性，我们在园区隔离至周一返回家中远程办公，8月22日父亲告诉我奶奶身体
        不太好，发高烧，让我问一下请假流程，8月24日凌晨1点左右，父亲告诉我奶奶过世，我定的8月24最早的一班火车回家并向领导请假，行内因为我鲁莽的行为对我进行了批评教育，我们经过商讨终止了合同。</p>
        <p style='text-indent: 32px;'>事闭回到西安已经是9月份了，9月8日10点面试泽诚控股有限公司，初试通过后，等待复试，一周后复试通过，让等待最终消息，国庆后，依然没有最终消息，届时西安疫情四起，
          小区封控，属实无奈，封控后，母亲多次希望我返回家中，外面的疫情太严重了，希望我回家躲一躲，没有工作每天只出不进，最终11月29日离开西安返回老家。</p>
      `},{id:6,title:"为什么会离开西安选择去上海工作?",answer:`<p ><span style='font-weight:bold'>缺钱，</span>
        西安的薪资和一线城市存在明显的区别，西安的福利待遇以及工作的效率也与一线城市存在明显不同，上海有老家一位发小，多少有个照应，目前暂时借宿发小家。</p>`}],e=d(!1),a=d({});return{questionList:p,dialogStatus:e,selectItem:a}}},v={class:"about"},b={class:"question-list-wrap"},C=["textContent","onClick"],k=["innerHTML"],I={class:"dialog-footer"};function S(p,e,a,t,V,L){const c=x("el-button"),_=x("el-dialog");return s(),l("div",v,[i("div",b,[(s(!0),l(f,null,g(t.questionList,(n,u)=>(s(),l("div",{key:u,textContent:m(n.title),class:"question-item",onClick:q=>(t.dialogStatus=!0,t.selectItem=n)},null,8,C))),128))]),r(_,{modelValue:t.dialogStatus,"onUpdate:modelValue":e[1]||(e[1]=n=>t.dialogStatus=n),width:"60%"},{footer:o(()=>[i("span",I,[r(c,{type:"primary",onClick:e[0]||(e[0]=n=>t.dialogStatus=!1)},{default:o(()=>[w("我知道了")]),_:1})])]),default:o(()=>[i("div",{innerHTML:t.selectItem.answer,class:"answer-content"},null,8,k)]),_:1},8,["modelValue"])])}const B=y(h,[["render",S],["__scopeId","data-v-da602f94"]]);export{B as default};
